[
  {
    "path": "Assignment1",
    "name": "Drawing Application",
    "desc": "Using a combination of variables, images, for loops, animations, conditional statements, text, color, etc. create a “Drawing Application” that uses keyboard and mouse user input. Must include at least one for loop and two conditional statement."
  },
  {
    "path": "astrosClassExample",
    "name": "JSON Demo - Class Example using Open Notify Astros API",
    "desc": "Use p5 to load and use JSON data using Open Notify Astros API."
  },
  {
    "path": "bubblesExample",
    "name": "Bubbles Example",
    "desc": "Starting from the class example of using arrays, I created a small app that makes bubbles move toward the mouse on click. This is also an example of using the instance mode for p5.js."
  },
  {
    "path": "jsonArrayClassExample",
    "name": "JSON Arrays Demo - Class Example",
    "desc": "Use p5 to load and use JSON data with arrays."
  },
  {
    "path": "jsonDemoClassExample",
    "name": "JSON Demo - Class Example",
    "desc": "Use p5 to load and use JSON data."
  },
  {
    "path": "narrativeClassExample",
    "name": "Class Example for using P5 to Make a Narrative",
    "desc": "Example from class for using P5 to create a narrative."
  },
  {
    "path": "owmClassExample",
    "name": "OpenWeatherMaps API Demo - Class Example",
    "desc": "Use p5 to load and use JSON data from the OpenWeatherMaps API."
  },
  {
    "path": "owmVisProject",
    "name": "OpenWeatherMaps Visualization Project",
    "desc": "Use OpenWeatherMaps and bike incident data to create a biking dashboard for a given area."
  },
  {
    "path": "p5ClassExample",
    "name": "Class Example for using P5",
    "desc": "Small example of using p5.js. This is also an example of using the instance mode for p5.js."
  },
  {
    "path": "p5DomClassExample",
    "name": "Class Example for using P5 DOM Library",
    "desc": "Small example of using the p5 DOM library This is also an example of using p5 loader for loading p5 and its libraries."
  },
  {
    "path": "webNarrativeProject",
    "name": "Web Narrative Project",
    "desc": "Using p5, create an interactive narrative web app that uses interactive HTML elements such as sliders, buttons, clicks, text boxes, etc. and CSS styling. This game is a variant of \"Hunt the Wumpus\""
  }
]